In [1]:
 import pandas as pd

In [10]:
csv_1=pd.read_csv("locations.csv")
csv_1

,location,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
0,Afghanistan,Asia,3.892834e+07,64.83,0.500,1803.987
1,Albania,Europe,2.877800e+06,78.57,2.890,11803.431
2,Algeria,Africa,4.385104e+07,76.88,1.900,13913.839
3,Andorra,Europe,7.726500e+04,83.73,NaN,NaN
4,Angola,Africa,3.286627e+07,61.15,NaN,5819.495
...,...,...,...,...,...,...
207,Yemen,Asia,2.982597e+07,66.12,0.700,1479.147
208,Zambia,Africa,1.838396e+07,63.89,2.000,3689.251
209,Zimbabwe,Africa,1.486293e+07,61.49,1.700,1899.775
210,World,NaN,7.794799e+09,72.58,2.705,15469.207
211,International,NaN,NaN,NaN,NaN,NaN

In [13]:
csv_2=pd.read_csv("italy-covid-daywise.csv")
csv_2

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
243  2020-08-30     1444.0         1.0    53541.0
244  2020-08-31     1365.0         4.0    42583.0
245  2020-09-01      996.0         6.0    54395.0
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[248 rows x 4 columns]

In [ ]:
#Finding Specific ROWS

In [14]:
csv_2=pd.read_csv("italy-covid-daywise.csv",nrows=9)
csv_2

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN
5  2020-01-05        0.0         0.0        NaN
6  2020-01-06        0.0         0.0        NaN
7  2020-01-07        0.0         0.0        NaN
8  2020-01-08        0.0         0.0        NaN

In [ ]:
#Finding Specific Columns by Name

In [16]:
csv_2=pd.read_csv("italy-covid-daywise.csv",usecols=["date","new_tests"])
csv_2

           date  new_tests
0    2019-12-31        NaN
1    2020-01-01        NaN
2    2020-01-02        NaN
3    2020-01-03        NaN
4    2020-01-04        NaN
..          ...        ...
243  2020-08-30    53541.0
244  2020-08-31    42583.0
245  2020-09-01    54395.0
246  2020-09-02        NaN
247  2020-09-03        NaN

[248 rows x 2 columns]

In [19]:
csv_2=pd.read_csv("italy-covid-daywise.csv",usecols=[0,2])
csv_2

           date  new_deaths
0    2019-12-31         0.0
1    2020-01-01         0.0
2    2020-01-02         0.0
3    2020-01-03         0.0
4    2020-01-04         0.0
..          ...         ...
243  2020-08-30         1.0
244  2020-08-31         4.0
245  2020-09-01         6.0
246  2020-09-02         8.0
247  2020-09-03         6.0

[248 rows x 2 columns]

In [ ]:
#Skip rows

In [24]:
csv_2=pd.read_csv("italy-covid-daywise.csv",skiprows=[0])
csv_2

     2019-12-31     0.0  0.0.1  Unnamed: 3
0    2020-01-01     0.0    0.0         NaN
1    2020-01-02     0.0    0.0         NaN
2    2020-01-03     0.0    0.0         NaN
3    2020-01-04     0.0    0.0         NaN
4    2020-01-05     0.0    0.0         NaN
..          ...     ...    ...         ...
242  2020-08-30  1444.0    1.0     53541.0
243  2020-08-31  1365.0    4.0     42583.0
244  2020-09-01   996.0    6.0     54395.0
245  2020-09-02   975.0    8.0         NaN
246  2020-09-03  1326.0    6.0         NaN

[247 rows x 4 columns]

In [ ]:
#Making Index

In [26]:
csv_1=pd.read_csv("locations.csv",index_col="location")
csv_1

,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
location,,,,,
Afghanistan,Asia,3.892834e+07,64.83,0.500,1803.987
Albania,Europe,2.877800e+06,78.57,2.890,11803.431
Algeria,Africa,4.385104e+07,76.88,1.900,13913.839
Andorra,Europe,7.726500e+04,83.73,NaN,NaN
Angola,Africa,3.286627e+07,61.15,NaN,5819.495
...,...,...,...,...,...
Yemen,Asia,2.982597e+07,66.12,0.700,1479.147
Zambia,Africa,1.838396e+07,63.89,2.000,3689.251
Zimbabwe,Africa,1.486293e+07,61.49,1.700,1899.775
World,NaN,7.794799e+09,72.58,2.705,15469.207
International,NaN,NaN,NaN,NaN,NaN

In [ ]:
#Making Header

In [28]:
csv_1=pd.read_csv("locations.csv",header=2)
csv_1

                 Albania         Europe     2877800.0  78.57   2.89  11803.431
0                Algeria         Africa  4.385104e+07  76.88  1.900  13913.839
1                Andorra         Europe  7.726500e+04  83.73    NaN        NaN
2                 Angola         Africa  3.286627e+07  61.15    NaN   5819.495
3               Anguilla  North America  1.500200e+04  81.88    NaN        NaN
4    Antigua and Barbuda  North America  9.792800e+04  77.02  3.800  21490.943
..                   ...            ...           ...    ...    ...        ...
205                Yemen           Asia  2.982597e+07  66.12  0.700   1479.147
206               Zambia         Africa  1.838396e+07  63.89  2.000   3689.251
207             Zimbabwe         Africa  1.486293e+07  61.49  1.700   1899.775
208                World            NaN  7.794799e+09  72.58  2.705  15469.207
209        International            NaN           NaN    NaN    NaN        NaN

[210 rows x 6 columns]

In [ ]:
#Creating New Heading

In [30]:
csv_5=pd.read_csv("locations.csv",names=["col1""col2","col3","col4","col5","col6"])
csv_5

,col1col2,col3,col4,col5,col6
location,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
Afghanistan,Asia,38928341.0,64.83,0.5,1803.987
Albania,Europe,2877800.0,78.57,2.89,11803.431
Algeria,Africa,43851043.0,76.88,1.9,13913.839
Andorra,Europe,77265.0,83.73,NaN,NaN
...,...,...,...,...,...
Yemen,Asia,29825968.0,66.12,0.7,1479.1470000000002
Zambia,Africa,18383956.0,63.89,2.0,3689.2509999999997
Zimbabwe,Africa,14862927.0,61.49,1.7,1899.775
World,NaN,7794798729.0,72.58,2.705,15469.207
International,NaN,NaN,NaN,NaN,NaN

In [ ]:
#Deleing Header and using prefix

In [31]:
csv_1=pd.read_csv("locations.csv")
csv_1

,location,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
0,Afghanistan,Asia,3.892834e+07,64.83,0.500,1803.987
1,Albania,Europe,2.877800e+06,78.57,2.890,11803.431
2,Algeria,Africa,4.385104e+07,76.88,1.900,13913.839
3,Andorra,Europe,7.726500e+04,83.73,NaN,NaN
4,Angola,Africa,3.286627e+07,61.15,NaN,5819.495
...,...,...,...,...,...,...
207,Yemen,Asia,2.982597e+07,66.12,0.700,1479.147
208,Zambia,Africa,1.838396e+07,63.89,2.000,3689.251
209,Zimbabwe,Africa,1.486293e+07,61.49,1.700,1899.775
210,World,NaN,7.794799e+09,72.58,2.705,15469.207
211,International,NaN,NaN,NaN,NaN,NaN

In [34]:
csv_5=pd.read_csv("locations.csv",header=None)
csv_5

,0,1,2,3,4,5
0,location,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
1,Afghanistan,Asia,38928341.0,64.83,0.5,1803.987
2,Albania,Europe,2877800.0,78.57,2.89,11803.431
3,Algeria,Africa,43851043.0,76.88,1.9,13913.839
4,Andorra,Europe,77265.0,83.73,NaN,NaN
...,...,...,...,...,...,...
208,Yemen,Asia,29825968.0,66.12,0.7,1479.1470000000002
209,Zambia,Africa,18383956.0,63.89,2.0,3689.2509999999997
210,Zimbabwe,Africa,14862927.0,61.49,1.7,1899.775
211,World,NaN,7794798729.0,72.58,2.705,15469.207
212,International,NaN,NaN,NaN,NaN,NaN

In [ ]:
#Changing type of the data values

In [35]:
csv_1=pd.read_csv("locations.csv")
csv_1

,location,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
0,Afghanistan,Asia,3.892834e+07,64.83,0.500,1803.987
1,Albania,Europe,2.877800e+06,78.57,2.890,11803.431
2,Algeria,Africa,4.385104e+07,76.88,1.900,13913.839
3,Andorra,Europe,7.726500e+04,83.73,NaN,NaN
4,Angola,Africa,3.286627e+07,61.15,NaN,5819.495
...,...,...,...,...,...,...
207,Yemen,Asia,2.982597e+07,66.12,0.700,1479.147
208,Zambia,Africa,1.838396e+07,63.89,2.000,3689.251
209,Zimbabwe,Africa,1.486293e+07,61.49,1.700,1899.775
210,World,NaN,7.794799e+09,72.58,2.705,15469.207
211,International,NaN,NaN,NaN,NaN,NaN

In [40]:
csv_1=pd.read_csv("locations.csv",dtype={"life_expectancy":"float"})
csv_1

,location,continent,population,life_expectancy,hospital_beds_per_thousand,gdp_per_capita
0,Afghanistan,Asia,3.892834e+07,64.83,0.500,1803.987
1,Albania,Europe,2.877800e+06,78.57,2.890,11803.431
2,Algeria,Africa,4.385104e+07,76.88,1.900,13913.839
3,Andorra,Europe,7.726500e+04,83.73,NaN,NaN
4,Angola,Africa,3.286627e+07,61.15,NaN,5819.495
...,...,...,...,...,...,...
207,Yemen,Asia,2.982597e+07,66.12,0.700,1479.147
208,Zambia,Africa,1.838396e+07,63.89,2.000,3689.251
209,Zimbabwe,Africa,1.486293e+07,61.49,1.700,1899.775
210,World,NaN,7.794799e+09,72.58,2.705,15469.207
211,International,NaN,NaN,NaN,NaN,NaN